'''
Дано двузначное число. Найдите число десятков в нем.
'''
digit = int(input())
print(digit // 10)
